[{"id":1,"title":"Cozy Knit Sweater","description":"Stay warm and stylish in our cozy knit sweater. Made from soft, breathable material, this sweater is perfect for cool weather. Features a crew neck and ribbed cuffs and hem. Available in multiple colors.","price":50,"thumbnail":"https://example.com/cozy-knit-sweater.jpg","code":"KNIT-001","stock":100},{"id":2,"title":"Wireless Bluetooth Earbuds","description":"Enjoy your music on the go with our wireless Bluetooth earbuds. With high-quality sound and noise-cancelling technology, these earbuds are perfect for commuting or working out. Comes with a charging case for on-the-go convenience.","price":75,"thumbnail":"https://example.com/wireless-earbuds.jpg","code":"EAR-001","stock":50},{"id":3,"title":"Essential Oil Diffuser","description":"Create a relaxing atmosphere in your home with our essential oil diffuser. Made from durable materials, this diffuser features a color-changing LED light and auto shut-off function. Perfect for use with your favorite essential oils.","price":40,"thumbnail":"https://example.com/essential-oil-diffuser.jpg","code":"DIFF-001","stock":75},{"id":4,"title":"Portable Charger","description":"Stay connected on-the-go with our portable charger. This compact charger is compatible with most smartphones and can provide up to two full charges. Comes with a convenient carrying pouch.","price":30,"thumbnail":"https://example.com/portable-charger.jpg","code":"CHRG-001","stock":150},{"id":5,"title":"Leather Wallet","description":"Keep your essentials organized with our leather wallet. Made from high-quality leather, this wallet features multiple card slots and a zippered coin pouch. Available in multiple colors.","price":60,"thumbnail":"https://example.com/leather-wallet.jpg","code":"WLT-001","stock":50},{"id":6,"title":"Stainless Steel Water Bottle","description":"Stay hydrated in style with our stainless steel water bottle. Made from durable materials, this water bottle features a leak-proof lid and a double-walled design to keep drinks cold for up to 24 hours. Available in multiple colors.","price":25,"thumbnail":"https://example.com/stainless-steel-water-bottle.jpg","code":"BTL-001","stock":200}]